class mornning {
  final String? title;
  final String? body;
  final String? best;
  int? count;

  mornning(
      {required this.title,
      required this.body,
      required this.best,
      required this.count});
}

List<mornning> model = [
  mornning(
    title: 'بسم الله الرحمن الرحيم ',
    body: '🌼اللهم أنت السلام ومنك السَّلام تباركت يا ذا الجلال والإكرام 🌼',
    count: 1,
    best: null,
  ),
  mornning(
    title: null,
    body:
        '🌼 لا إله إلا الله وحده لا شريك له، له الملك وله الحمد يُحيي ويميت وهو على كل شيء قدير.🌼',
    count: 10,
    best: null,
  ),
  mornning(
    title: null,
    body:
        '🌼لا إله إلا الله وَحدَهُ صدق وعدَهُ ونَصر عبدَهُ وأعزَّ جُنْدَهُ وهزَمَ الأحزاب وَحدَهُ لا شيء قَبْلَهُ ولا شيء بعدَهُ لا إله إلا الله ولا نعبد إلا إياه مُخلِصين له الدِّينَ ولو كَرهَ الكَافِرُونَ .🌼',
    count: 1,
    best: null,
  ),
  mornning(
    title: null,
    body: '🌼 اللهم أجرني مِنَ النَّارِ🌼',
    count: 7,
    best: ' عن مسلم بن الحارث التميمي ، عن رسول الله ، أنه أسر'
        'إليه فقال: (( إذا انصرفت من صلاة المغرب فقل: اللهم أجرني من النار سبع مرات فإنك إذا قلت ذلك ثم مُتَّ من ليلتك كُتب لك جوارٌ منها، وإذا صليت الصبح فقل كذلك فإنك إن مت من يومك كُتب لك جوار منها )) أخرجه أبو داود وغيره.',
  ),
  mornning(
      title: null,
      body: '🌼اللهُمَّ إِنِّي أسألك رضاك والجنَّة   🌼',
      count: 8,
      best: null),
  mornning(
      title: null,
      body: '🌼  أعوذُ بكلماتِ اللهِ التَّامَاتِ كلّها مِنْ شَرِّ ما خلق  🌼',
      count: 3,
      best:
          ' عن خولة بنت حكيم السلمية ، تقول : سمعت رسول الله صلى الله عليه وسلم يقول: " مَنْ نزل منزلاً، ثم قال: أعوذ بكلمات الله التَّامَّاتِ من شر ما خلق لم يضره شيء حتى يرتحل من منزله ذلك " أخرجه مسلم وغيره. '),
  mornning(
      title: null,
      body: '🌼اللَّهُمَّ إنا نعوذُ بك من شر الفتن ما ظهر منها وما بطن 🌼',
      best: null,
      count: 3),
  mornning(
      title: null,
      body: ' 🌼  بسم  '
          'الله الذي لا يضر مع اسمه شيء في الأرض '
          'ولا في السَّماء وهو السميع العليم',
      best:
          'من قاله حين يُصبح ثلاثاً وحين يمسي ثلاثاً لم يضره شيء. وفي رواية لم يصبه جنون ولا جذام ولا فالج، كما في الترمذي وغيره حيث علمها لأبي بكر . ',
      count: 3),
  mornning(
      title: null,
      body: '🌼بسم الله على نفسي وأهلي ومالي🌼',
      best:
          'عن ابن عباس ، أن رجلاً شكا إلى رسول الله الله أنه تصيبه الآفات، فقال له رسول الله صلى الله عليه وسلم : قل إذا أصبحت بسم ا الله على نفسي وأهلي ومالي، فإنه لا يذهب لك شيء))، فقالهنَّ فذهبت عنه الآفات.'
          ' أخرجه ابن السنّي في عمل اليوم والليلة.',
      count: 3),
  mornning(
      title: null,
      body: 'اللهم لا مانع لما أعطيت ولا معطي لما منعت و لا '
          'راد لما قضيت، ولا ينفع ذا الجد منك الجَدُّ ولا'
          'حول ولا قوة إلا بالله العلي العظيم',
      best:
          'ورد في فتح الباري معنى (منك) أي: عندك، أي لا ينفع ذا الغنى عندك غناه، إنما ينفعه العمل الصالح.'
          'ثم قال الإمام النووي رحمه الله تعالى في قوله: (الجَدُّ) الصحيح المشهور الذي عليه الجمهور أنه بالفتح، وهو الحظ في الدنيا من المال أو الولد'
          'أو العظمة أو السلطان، والمعنى لا ينجيه حظه منك وإنما ينجيه فضلك ورحمتك. ',
      count: 3),
  mornning(
      title: null,
      body:
          '🌼رضينا بالله تعالى ربّاً وبالإسلام ديناً وبسيدنا محمد نبيا ورسولا🌼 ',
      best:
          'من قالها ثلاثاً صباحاً ومساءً كان حقاً على الله أن يُرضيه . أخرجه الإمام أحمد في'
          'مسنده، وفي رواية عند أبي داود عن أبي سعيد الخدري (( وجبت له الجنة )) .',
      count: 3),
  mornning(
      title: null,
      body: 'اللَّهُمَّ إنّا نعوذُ بكَ مِنْ أن نُشرك'
          'بك شيئاً نعلمه ونستغفرك لما لا نعلمه إنك أنـــت عــــلام'
          'الغيوب',
      best:
          'عن قيس بن أبي حازم قال : سمعت أبا بكر الصديق يقول: قال رسول الله صلى الله عليه وسلم :'
          'إن من الشرك ما هو أخفى من دبيب النمل على الصفا، قال: يقول أبو بكر يا رسول الله، وكيف المنجا والمخرج من ذلك؟'
          'قال: ألا أخبرك بشيء إذا قلته برنت من قليله وكثيره؟ قل: اللهم إنا نعوذ .... أخرجه الإمام أحمد في مسنده وغيره بألفاظ متقاربة.',
      count: 3),
  mornning(
      title: '🌼سيد الاستغفار🌼',
      body:
          'للَّهُمَّ أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت، أعوذُ بك من شر ما صنعت، '
          'أبوء لك بنعمتك عليَّ، وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت ',
      best:
          'قال رسول الله صلى الله عليه وسلم : (( من قالها من النهار موقنا بها فمات من يومه قبل أن يمسي فهو من أهل قالها من الليل وهو موقن بها فمات قبل ومن أن يصبح فهو من أهل الجنة )).',
      count: 1),
  mornning(
      title: null,
      body:
          '🌼 اللَّهُمَّ إني أصبحت ( أو أمسيت ) منك في نعمة وعافية وستر فأتم نعمتك علي وعافيتـك وسترك في الدنيا والآخرة🌼',
      best: '',
      count: 3),
  mornning(
      title: null,
      body: "اللهم ما أصبح (أو ما أمسى) بي من نعمة أو "
          "بأحدٍ من خلقك فمنك وحدك لا شريك لك فلك الحمد ولك الشكر ",
      best:
          " (( من قرأها صباحاً ومساءً فقد أدى شكر يومه وليلته .)). أخرجه أبو داود والنسائي وابن حبان في صحيحه بألفاظ متقاربة.",
      count: 1),
  mornning(
      title: null,
      body:
          "اللهم إني أصبحت ( أو أمسيت ) أُشهدك وأشهد حملة عرشك وملائكتك وجميع خلقك أنك أنت الله لا إله إلا أنت وحدك لا شريك لك وأن سيدناصل الله"
          "محمداً عبدك ورسولك",
      best:
          "(( من قالها أربع مرات حين يصبح وحين يمسي أعتقه الله من النار )) . أخرجه أبو داود والإمام البخاري في الأدب المفرد.",
      count: 4),
  mornning(
      title: null,
      body: 'بسم الله ما شاء الله لا يسوق الخير إلا الله،'
          '\n'
          'بسم الله ما شاء الله لا يصرف السوء إلا الله،'
          '\n'
          'بسم الله ما شاء الله ما كان من نعمة فمن الله'
          '\n'
          '🌼بسم الله ما شاء الله لا حول ولا قوة إلا بالله العلي العظيم🌼',
      best:
          'هذه الكلمات يفترق عنها سيّدنا إلياس وسيدنا الخضر كل عام، كما رواه ابن أبي الدنيا، وقال ابن عباس : (( من قالهنَّ حين يمسي وحين يصبح (ثلاثاً) آمنه الله من الغرق والحرق والسَّرَق ومن الشيطان والسلطان وغير ذلك )).',
      count: 3),
  mornning(
      title: null,
      body:
          '🌼اللهم أنت ربي لا إله إلا أنت، عليك توكلت وأنت رب العرش العظيم، ما شاء الله كان وما لم'
          'يشأ لم يكن ولا حول ولا قوة إلا بالله العلي العظيم، أعلمُ أنّ الله على كل شيء قدير، وأن الله قد'
          'أحاط بكلّ شيء علما، اللهُمَّ إِنِّي أعوذ بك من شر نفسي، ومن شر كل دابة أنت آخذ بناصيتها،'
          'إنّ ربّى على صراط مستقيم . 🌼',
      best:
          ' (( من قالها أول النهار لم تصبه مصيبة حتى يمسي ومن قالها آخر النهار لم تصبه مصيبة حتى يصبح )). أخرجه أبو داود.',
      count: 1),
  mornning(
      title: null,
      body: 'اللهُمَّ إنِّي أعوذ بك من الهم والحزن وأعوذ بك من🌼'
          'العجز والكسل وأعوذ بك من الجبن والبخل وأعوذ'
          '🌼بك من غلبة الدين وقهر الرجال',
      best:
          '(( من قالها صباحاً ومساءً ذهب همه وقُضي دينه )) . أخرجه أبو داود في سننه . ',
      count: 1),
  mornning(
      title: null,
      body:
          '🌼 اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري لا إله إلا أنت 🌼',
      best: null,
      count: 1),
  mornning(
      title: null,
      body: '   اللَّهُمَّ إِنِّي أعوذ بك من الكفر والفقر وأعــــوذ'
          'بك من عذاب القبر لا إله إلا أنت  ',
      best: 'خرجهما أبو داود في سننه عن أبي بكرة ، وقد كان يقولهن دبر الصلاة،'
          'ويدعو بهن في روايات مختلفة.',
      count: 3),
  mornning(
      title: null,
      body: '🌼الحمد لله حمداً يُوافي نعمه ويدفع نقمه ويُكافئ مزيده 🌼',
      best: null,
      count: 3),
  mornning(
      title: null,
      body: '🌼 يا رب لك الحمد كما ينبغي لجلال وجهك ولعظيم سلطانك🌼',
      best:
          'يقول الله عز وجل للملكين: (( اكتباها كما قال عبدي حتى يلقاني فأجزيه بها )). أخرجه أحمد وابن ماجه ورجاله ثقات.',
      count: 3),
  mornning(
      title: null,
      body: ' 🌼يا حي يا قيوم برحمتك أستغيث أصلح لي شأني'
          'كله ولا تكلني إلى نفسي طرفة عين.🌼',
      best:
          '(( من قالها فقد دعا بخيري الدنيا والآخرة ... أخرجه الحاكم وصححه و وافقه الذهبي.'
          'وعن أنس، أن النبي صلى الله عليه وسلم قال لابنته السيدة فاطمة : ((ما يمنعك أن تسمعي ما أوصيك به؟ تقولين إذا أصبحت وإذا أمسيت : يا حي يا قيوم....) أخرجه النسائي والحاكم.',
      count: 1),
  mornning(
      title: null,
      body: '.جزى الله عنا سيّدنا محمّداً بما هو أهله 🌼',
      best: null,
      count: 3),
  mornning(
      title: null,
      body:
          '🌼لا إله إلا الله قبل كل شيء، لا إله إلا الله بعد كل شيء، لا إله إلا الله يبقى ربنا ويفني كل شيء 🌼',
      best:
          '  عن ابن عباس عن النبي  ﷺ أنه قال: (( من قالهنَّ عوفي من الهم والحزن )). ( أخرجه الطبراني)',
      count: 1),
  mornning(
      title: null,
      body: '🌼سبحان الله وبحمده عدد خلقه ورضاء نفسه وزنة عرشه ومداد كلماته 🌼',
      best: null,
      count: 3),
  mornning(
      title: null,
      body: '🌼اللهمَّ  َصلِّ على سيدنا محمَّدٍ كلَّما ذكره'
          'الذاكرون وغفل عن ذكره الغافلون🌼',
      best:
          'عن جويرية ، أن النبي خرج من عندها ثم رجع بعد أن أضحى وهي جالسة، فقال: (( ما زلت على الحال التي فارقتك عليها )) ؟ '
          'فقالت: نعم، فقال النبي صلى الله عليه وسلم: (( لقد قلت بعدك أربع كلمات ثلاث مرات لو وزنت بما قلتِ منذ اليوم لوزنتهنَّ: '
          'سبحان الله .... (( أخرجه الإمام مسلم وغيره، أما عبارة (( كلما ذكره الذاكرون فقد وردت في تخريج أحاديث الإحياء عن الإمام الشافعي أنه صلى بما على رسول الله صلى الله عليه وسلم وجزي أنه لا يُوقف للحساب.',
      count: 3),
  mornning(
      title: null,
      body: '🌼.سبحان الله العظيم وبحمده، لا حول ولا قوة إلا بالله🌼',
      best: null,
      count: 1),
  mornning(
      title: null,
      body:
          '🌼اللهم إني أسالك مما عندك، وأفض عليَّ من فضلك، وانشر على من رحمتك، وأنزل علي من بركاتك، وألبسني أثواب عافيتك🌼',
      best:
          'عن قبيصة ابن المخارق أن رسول الله صلى الله عليه وسلم قال: (( من وافى بمن - بأن لم يتركهن حتى جاء بمن - يوم القيامة لتفتحن عليه أبواب الجنة يدخل من أيها شاء، وأمن من العمى والجذام والبرص والفالج (( أخرجه ابن السني وابن أبي الدنيا. والحديث بتمامه في كتاب السنة النبوية للمؤلف.',
      count: 3),
  mornning(
      title: null,
      body:
          '🌼لا إله إلا الله والله أكبر، لا إله إلا الله وحده، لا إله إلا الله لا شريك له، لا إله إلا الله له الملك وله الحمد، لا إله إلا الله ولا حول ولا قوة إلا بالله 🌼',
      best: null,
      count: 1),
  mornning(
      title: null,
      body: '🌼اللهم بارك لي في الموت وفي ما بعد الموت 🌼',
      best:
          'عن عائشة قالت: قلت يا رسول الله، ليس الشهيد إلا من قتل في سبيل الله فقال: (( يا عائشة، إن شهداء أمتي إذا لقليل من قال في يوم خمسة وعشرين مرة (( اللهم بارك ... )) ثم مات على فراشه أعطاه الله أجر شهيد )). أخرجه الطبراني.',
      count: 25),
];
