import 'package:flutter/material.dart';

class werd {
  final Text? body;
  // final Text? best;
  int? count;

  werd({required this.body, required this.count});
}

List<werd> modelwerd = [
  werd(
    body: const Text('بعد صلاة الفجر وبعد صلاة المغرب يقول المريد:'
        '\n'
        ' أعوذ بالله من الشيطان الرجيم . 🌼'),
    count: 1,
  ),
  werd(
    body: const Text(
      '🌼بسم الله الرحمن الرحيم .🌼',
    ),
    count: 3,
  ),
  werd(
      body: const Text(
          ' وَمَا نُقَدِّمُوا لأَنفُسِكُم مِّنْ خَيْرٍ تَجِدُوهُ عِندَ اللَّهِ هُوَ خَيْرًا وَأَعْظَمَ أَجْراً وَاسْتَغْفِرُوا اللَّهَ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ.'),
      count: 1),
  werd(body: const Text('🌼 أستغفر الله🌼 .'), count: 99),
  werd(
      body: const Text(
          '🌼 أستغفر الله العظيم الذي لا إله إلا هو الحي القيوم وأتوب إليه 🌼.'),
      count: 1),
  werd(
      body: const Text(
          '🌼 إِنَّ اللَّهَ وَمَلَيْكَتَهُ يُصَلُّونَ عَلَى النَّبِيُّ يَأَيُّهَا الَّذِينَ ءَامَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا.🌼'),
      count: 1),
  werd(
      body: const Text(' 🌼اللهم صل على سيدنا محمد عبدك ورسولك'
          'النبي'
          'الأمي وعلى آله وصحبه وسلم 🌼.'),
      count: 99),
  werd(
      body: const Text(
          ' 🌼اللهم صل على سيدنا محمد عبدك ورسولك النبي الأمي وعلى آله وصحبه وسلم تسليماً كثيراً   '
          'بقدر عظَمة ذاتك في كل وقت وحين 🌼.'),
      count: 1),
  werd(
      body: const Text(' 🌼 فَأَعْلَمْ أَنَّهُ لَا إِلَهَ إِلَّا اللهُ. 🌼'),
      count: 1),
  werd(
      body: const Text('🌼 لا إله إلا الله وحده لا شريك له، له الملك'
          'وله الحمد وهو على كل شيء قدير 🌼.'),
      count: 99),
  werd(
      body: const Text(
          '🌼لا إله إلا الله سيدنا محمد رسول الله صلى الله عليه وعلى آله وصحبه وسلّم .🌼'),
      count: 1),
  werd(
      body: const Text('بسم الله الرحمن الرحيم '
          '\n'
          'قل هو الله أحد * الله الصمد * لم يلد ولم يولد * ولم يكن له كفواً أحد *'),
      count: 3),
  werd(
      body: const Text('بسم الله الرحمن الرحيم '
          '\n'
          'الحمد لله رب العالمين * الرحمن الرحيم * مالك يوم الدين * إياك نعبد وإياك نستعين * اهدنا الصراط المستقيم * صراط الذين أنعمت عليهم * غير المغضوب عليهم ولا الضالين'),
      count: 1),
];
