import 'package:flutter/material.dart';

class Diffrent {
  Text? title;
  Text? body;
  // RichText? s;
  Diffrent({required this.body, required this.title});
}

List<Diffrent> Grid = [
  // Diffrent(title: const Text(' 🌼حزب البحر🌼 '), body: const Text('')),
  Diffrent(
    title: const Text('🌼دلائل الخيرات🌼'),
    body: const Text(''),
  ),
  Diffrent(
    title: const Text('الصلاةالمشيشية 🌼'),
    body: const Text(
        'اللهمَّ صلِّ على منْ منهُ انشقتِ الأسرارُ ، وانفلقتِ الأنوارُ ، وفيهِ ارتقتِ الحقائقُ ، وتنـزلتْ علومُ آدمَ عليهِ السلامُ فأعجزَ الخلائقَ ، ولهُ تضاءلتِ الفهومُ فلمْ يدركهُ منا سابقٌ ولا لاحقٌ ، فرياضُ الملكوتِ بزهرِ جمالهِ مونقةٌ ، وحياضُ الجبروتِ بفيضِ أنوارهِ متدفقةٌ ولا شيءَ إلا وهو بهِ منوطٌ ، إذْ لولا الواسطةُ لذهبَ –كما قيلَ- الموسوطُ ، صلاةً تليقُ بكَ منكَ إليهِ كما هو أهلهُ .'
        ' اللهمَّ إنهُ سِرُّكَ الجامعُ الدالُّ عليكَ ، وحجابكَ الأعظمُ القائمُ لكَ بينَ يديكَ .'
        'اللهمَّ ألحقني بنسبهِ وحققني بحسبهِ ، وعَرِّفْنِي إياهُ معرفةً أسلمُ بها منْ مواردِ الجهلِ ، وأكرعُ بها منْ مواردِ الفضلِ ، واحملني على سبيلهِ إلى حضرتِكَ حملاً محفوفاً بنصرتِكَ واقذفْ بي على الباطلِ فأدمغَهُ ، وزُجَّ بي في بحارِ الأحديةِ وانشلني منْ أوحالِ التوحيدِ ، وأغرقني في عينِ بحرِ الوحدةِ حتى لا أرى ولا أسمعَ ولا أجدَ ولا أحسَّ إلا بها .'
        'واجعلِ الحجابَ الأعظمَ حياةَ روحي ، وروحهُ سِـرَّ حقيقتي وحقيقتهُ جـامعَ عوالمـي بتحقيقِ الحقِّ الأولِ '
        '( يا أولُ يا آخرُ يا ظاهرُ يا باطنُ ) ( ثلاثاً )'
        'اسمعْ ندائي بما سمعتَ بهِ نداءَ عبدكَ زكرياءُ عليهِ السلامُ '
        '( وانصرني بكَ لكَ وأيدني بكَ لكَ ، واجمعْ بيني وبينكَ وحُلْ بيني وبينَ غيركَ ) ( ثلاثاً )  ، اللهُ ، اللهُ ، اللهُ '
        '( إِنَّ الَّذِي فَرَضَ عَلَيْكَ القُرْآنَ لَرَادُّكَ إِلى مَعَادٍ )'
        '( رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا ) ( ثلاثاً )'
        '( إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا'),
  ),
  Diffrent(
    title: const Text('الصلاة العظيمية 🌼'),
    body: const Text('🌼الصلاة العظيمية لسيدي أحمد بن إدريس رحمه الله تعالى🌼'
        '\n'
        '🌼اللَّهُمَّ إِنِّي أسألك بنور وجه الله العظيم \n🌼  الذي ملأ  أركان عرش'
        '🌼الله العظيم\n  🌼وقامت به عوالم الله العظيم \n '
        '🌼أن تصلي على مولانا محمد ذِي القَدْر العظيم \n'
        'وعلى آل نبي الله العظيم \n 🌼 بقدر عظمةِ ذاتِ الله العظيم \n 🌼'
        'في كلّ لمحة ونفس عدد ما في علمِ الله العظيم \n صلاة دائمة بدوام الله العظيم\n🌼'
        ' تعظيما لحقك يا مولانا يا محمد يا ذا الخلق العظيم \n 🌼وسلم عليه وعلى آله مثل ذلك، '
        'واجمع بيني وبينه كما جمعت بين الرُّوحِ والنَّفْسِ ظاهرا وباطنا يقظةً ومناماً /n'
        ' واجعله يا رب روحاً لذاتي مــن جميــع الوجوه في الدنيا قبل الآخرة يا عظيم.🌼'),
  ),
  Diffrent(title: const Text(' 🌼ورد الأصيل🌼 '), body: const Text('')),
  Diffrent(
    title: const Text('🌼الاستغفارالكبير🌼'),
    body: const Text('🌼الاستغفار الكبير لسيدي أحمد بن إدريس رحمه الله تعالى🌼'
        '\n'
        '🌼أستغفر الله العظيم الذي لا إله إلا هو الحي القيوم \n'
        'غفار الذنوب ذا الجلال والإكرام وأتوب إليه، من جميع المعاصي كلها، والذنوب والآثام \n'
        'ومن كل ذنب أذنبته عمداً وخطاً ظاهراً وباطناً قولاً وفعلاً،\n'
        ' في جميع حركاتي وسكناتي وخطراتي وأنفاسي كلها دائماً، أبداً سرمداً من الذنب الذي أعلم، ومن الذنب الذي لا أعلم،\n'
        ' عَدَدَ ما أحاطَ بهِ العلم وأحصاه الكتاب وخطَّهُ القلم \n '
        'وعدد ما أوجدته القدرة وخصصته الإرادة'
        'ومداد كلمات الله، كما ينبغي لجلال وجه ربنا وجماله و كماله وكما يحبُّ ربنا ويَرضَى.🌼'
        '\n'
        '🌼🌼🌼🌼🌼🌼'),
  ),
  // Diffrent(
  //   title: const Text('🌼2دلائل الخيرات🌼'),
  //   body: const Text.rich(
  //     TextSpan(
  //       text: 'Hellwow',
  //       children: [
  //         TextSpan(
  //             text: '   Beutiful',
  //             style: TextStyle(fontStyle: FontStyle.italic)),
  //         TextSpan(
  //             text: '        Sally ',
  //             style: TextStyle(fontWeight: FontWeight.bold)),
  //       ],
  //     ),
  //   ),
  // ),
  Diffrent(
    title: const Text(' 🌼حزب البحر🌼 '),
    body: const Text('حزب البحر'
        'لسيّدي أبي الحسن الشاذلي رحمه الله تعالى'
        ' اللهم يا علي يا عظيم يا حليم يا عليم أنت ربي، وعلمُكَ حسبي، فَنَعْمَ الربُّ ربّي، ونعم الربُّ ربّي، ونِعْمَ الحسبُ حسبي تَنصُرُ مَنْ تشاء وأنت العزيز الرحيمُ،'
        ' نَسألك العصمة في الحركاتِ والسَّكَنَاتِ والكَلِمَاتِ وَالإِرَادَاتِ والخَطَرَاتِ مِنَ السُّكُوكِ والظُّنُّونِ والأَوْهَامِ السَّاتِرةِ للقلوب عن مطالعة الغيوب،'
        ' فقدِ ابْتُلِيَ الْمُؤْمِنُونَ وَزُلْزِلُوا زِلْزَالَا شَدِيدًا * وَإِذْ يَقُولُ الْمُنفِقُونَ وَالَّذِينَ فِي قُلُوبِهِم مَّرَضٌ '
        'مَّا وَعَدَنَا اللَّهُ وَرَسُولُهُ إِلَّا غُرُورًا ) ، فتبتنا وانْصُرْنَا وسَخَّرْ لَنَا هذا البَحْرَ كَمَا سَخَّرت البَحْرَ مُوسَى وَسَخَّرْتَ النَّارَ لإبراهيم وسَخَّرْت الجبال والحديدَ لدَاوُدَ،'
        ' وَسَخَّرْتَ الرِّيحَ والشياطين والجنَّ لِسُلَيمانَ ، وسَخَّرْ لنا كل بحر هو لك في الأرض والسماء والملكِ والملكوت وبحر الدنيا وبحر'
        'الآخرةِ ، وسَخَّرْ لَنَا كُلَّ شَيْءٍ، يَا مَنْ بِيدِهِ مَلَكُوتُ كُلِّ شَيءٍ كهيعص كهيعص كهيعص) '
        'انصُرْنَا فَإِنَّكَ خَيرُ النَّاصِرِينَ، وافتح لنا فإنَّكَ خيرُ الفَاتِحِينَ، واغفِرْ لَنَا فإنك خيرُ الغَافِرِينَ، وارحمنا فإنك خيرُ الرَّاحِمينَ،'
        ' وارزقنا فإِنَّكَ خيرُ الرّازِقِينَ، وَاهْدِنَا وَنَجِّنَا مِنَ القَوْمِ الظَّالِمِينَ، وَهَبْ لَنَا ريحاً طيبةً كما هي في عِلمِكَ، وانشرها علينا مِنْ خَزَائِنِ رحمتِكَ، '
        'وَاحِمِلْنَا بِها حَمْلَ الكرامة معَ السّلامة والعافية في الدين والدنيا والآخرة إنك على كل شيء قدير. اللَّهُمَّ يَسر لنا أُمُورَنَا مَعَ الراحة لقلوبنا وأبداننا، والسلامة والعافية في ديننا ودنيانا'
        ' وكُن لنا صَاحِباً في سَفَرِنا، وخليفةٌ في أهلنا، واطْمِس على وُجوهِ أَعدائِنَا وَامْسَحْهُم على مكانتهم فلا يستطيعون المضيَّ ولا المَجِيءَ إِلينا ( وَلَوْ نَشَاءُ لَطَمَسْنَا'
        '٢٦'
        'عَلَى أَعْيُنِهِمْ فَاسْتَبَقُوا الصِّرَاطَ فَأَنَّى يُبْصِرُونَ * وَلَوْ نَشَاءُ لَمَسَخْتَهُمْ عَلَى مَكَانَتِهِمْ فَمَا اسْتَطَاعُوا مُضِيَّا وَلَا يَرْجِعُونَ ) ( يس ) وَالْقُرْمَانِ الْحَكِيمِ إِنَّكَ لَمِنَ الْمُرْسَلِينَ * عَلَى صِرَاطٍ مُسْتَقِيمٍ * تَنزِيلَ الْعَزِيزِ الرَّحِيمِ * لِتُنذِرَ قَوْمًا مَّا أَنذِرَ ابَاؤُهُمْ فَهُمْ غَفِلُونَ * لَقَدْ حَقَّ الْقَوْلُ عَلَى أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُونَ * إِنَّا جَعَلْنَا فِي أَعْتَقِهِمْ أَغْلَلًا فَهِيَ إِلَى الْأَذْقَانِ فَهُم تُقْمَحُونَ * وَجَعَلْنَا مِنْ بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَهُمْ فَهُمْ لَا يُبْصِرُونَ ،'
        ' شَاهَتِ الوُجُوهُ، شَاهَتِ الوُجُوهُ، شَاهَتِ الوُجُوهُ وَعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ وَقَدْ خَابَ مَنْ حَمَلَ ظُلْمًا ) (طس ) (طسم ) حم عسق ) مرج الْبَحْرِينِ يَلْتَقِيَانِ بَيْنَهُمَا بَرْزَخٌ لا يَبْغِيَانِ ( حم حم حم حم حم حم حم . حُمَّ الأَمْرُ وجاء النصر فعلينا لا يُنْصَرون.۲۷'),
  ),
  // Diffrent(title: const Text('🌼أدعية الفران🌼'), body: const Text('')),
  Diffrent(
    title: const Text('🌼دعاء النصف  من شعبان🌼'),
    body: const Text('\n'
        'اللَّهُمَّ يا ذا المـن ولا يُمن عليه، يا ذا الجلال والإكرام يا ذا الطَّول والإنعام،\n'
        ' لا إله إلا أنت، ظهر اللاجئين وجار المستجيرين وأمان الخائفين.'
        '\n'
        ' اللهم إن كُنتَ كتبتني عندك شقياً أو محروماً أو مطروداً أو مُقتَراً عليَّ في الرزق، \nفامحُ اللَّهُمَّ بفضلك شقاوتي وحرماني وطردي وإقتار رزقي،'
        ' وأثبتني عندك سعيداًمرزوقاً موفقاً للخيرات ,\n فإنك قلت وقولك الحق في كتابك المنزل على لسان نبيك المرسل '
        '\n'
        '<< يَمْحٌو اللهُ مَا يَشَاءُ ويُثْبِتْ وَ عِنْدَهُ أُمُّ الْكِتَابْ>> '
        'إلهى بالتجلي الأعظم في ليلة النصف من شهر شعبان المكرم التي يُفْرق فيها كُلّ أمرٍ حكيم ويُبرم\n'
        ' \n'
        ' نسألك يا أرحم الراحمين (۳) مرات '
        '\n'
        ' أن تصرف عنا وعن المؤمنين من البلاء و الوباء والغلاء '
        'وتَسلَّط الأعداء ما نعلم وما لا نعلم وما أنت به أعلم إنك أنت '
        'الأعزُّ الأكرم .'
        '\n'
        'وصلى الله على سيدنا محمد وعلى آله وصحبه وسلّم .'),
  ),
];
